12/data/attachments/c30a8daeba4c27c4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b8bdc268-8d1c-4fe1-af39-b8ece679cdb1</nif:username>
            <nif:friendToBeAdded>Kristen_account_Actions_81973_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>